REG_1 = '''<b>Добро пожаловать.</b>

Данный бот был создан для улучшенея опыта работы студенческих групп и автоматизации бытовых действий. Для начала вам нужно пройти быстрый процесс регистрации.

<b>Шаг 1/3</b>: Укажите своё имя на киррилице. Можно с фамилией. Главное, чтобы было ясно, что вы - это вы.'''

REG_2 = '''Регистрируясь, вы принимаете <a href = "https:example.com">условия пользования ботом</a>:

1. Все возможности в боте предоставляются "как есть". Разработчик бота и его администраторы не несут никаких обязательств по администрированию бота.
2. Все действия пользователей, кроме анонимных писем, могут записываться в консоль с целью исправления багов и обеспечения безопасности пользователей.
3. Блокируя бота, вы добровольно отказываетесь от получения важной информации, которая через него может отправляться.
4. Используя бота, вы и только вы несёте ответсвенность за свои действия. Запрещено искать уязвимости бота, пытаться дестабилизировать его хостинг и совершать с ним любые аморальные действия. В качестве наказания за нарушения правил может применяться блокировка определённых команд для пользователя.

<b>Шаг 2/3:</b> Если вы ознакомлены и согласны с этими условиями, отправьте в чат "<code>Ознакомлен, согласен</code>" или "<code>Ознакомлена, согласна</code>".'''
