REG_1 = '''<b>Добро пожаловать.</b>

Данный бот был создан для улучшенея опыта работы студенческих групп и автоматизации бытовых действий. Для начала вам нужно пройти быстрый процесс регистрации.

<b>Шаг 1/3</b>: Укажите своё имя. Имя <b><u>НЕ</u> должно</b>:

<i>1. быть длиннее 24 символов;
2. быть на нескольких раскладках (<u>V</u>ася, <u>Z</u>а<u>L</u>упа и т.д.);
3. содержать цифры и знаки препинания.</i>'''

REG_2 = '''Регистрируясь, вы принимаете условия пользования ботом:

1. Все возможности в боте предоставляются "как есть".
Разработчик бота и его администраторы не несут никаких обязательств по администрированию бота.

2. Любые действия пользователей могут логироваться с целью исправления багов и обеспечения безопасности пользователей.

3. Блокируя бота, вы добровольно отказываетесь от получения важной информации, которая через него может отправляться.

4. Используя бота, вы и только вы несёте ответсвенность за свои действия.
Запрещено искать уязвимости бота, пытаться дестабилизировать его хостинг и совершать с ним любые аморальные действия.
В качестве наказания за нарушения правил может применяться блокировка определённых команд для пользователя.

<b>Шаг 2/3:</b> Если вы ознакомлены и согласны с этими условиями, отправьте в чат "<code>Ознакомлен, согласен</code>" или "<code>Ознакомлена, согласна</code>".'''

REG_3 = '''<b>Данные сохранены!</b>

<i>Теперь вы можете использовать весь функционал бота.
Выберете "Помощь по всем командам" в Меню или используйте <code>/help</code>, чтобы получить справку по командам.</i>

<b>Шаг 3/3:</b> Выберете свою группу из списка.'''

EXAM_1 = f'''Уточните свой запрос, введя 1-2 аргумента, согласно следующим примерам:

<b>Пример 1:</b> <code>/exam мп 13</code> - 13 вопрос по Международному праву <i>(указать предмет можно первыми буквами (МП), первым словом (Международное), полным названием (международноеправо) и т.д.)</i>;

<b>Пример 2:</b> <code>/exam понятие, признаки</code> - поиск вопроса по ключевым словам <i>(чем меньше ключевых слов - тем шире поиск);</i>

<b>Пример 3:</b> <code>/exam фп</code> - открыть меню с вопросами во конкретному предмету;

<b>Пример 4:</b> <code>/exam question zemelnoe</code> - вывести только вопросы к экзамену по земельному праву (question можно заменить на q);

Команды не для просмотра ответов:
1. <code>/exam set Философия</code> - создать постоянный перечень вопросов к экзамену.
2. <code>/exam delete гп</code> - удалить вопросы к экзамену.

<b>Предварительно предлагаю выбрать перечень вопросов и ответов к одму из следующих экзаменов:</b>'''
